## -------------------------------------------------- 初始化资源 -------------------------------------------------- ##
scoreboard objectives add yum dummy
title @a reset

# -------------------------------------------------- item -------------------------------------------------- #

# -------------------------------------------------- reminder -------------------------------------------------- #
## 重置游戏时间
scoreboard players reset .playtime yum
## 30min 后提醒玩家休息
schedule function yum:reminder 1800s replace

# -------------------------------------------------- villager -------------------------------------------------- #
schedule function yum:villager/disable_trade 20t replace